# Дано натуральное число. Выведите его последнюю цифру.
num = int(input())
print(num % 10)