# Напишите программу, которая приветствует пользователя, выводя слово Hello.
name = input()
print('Hello, ', name, '!', sep='')
