# Дано целое число N. Выведите следующее за ним четное число.
num = int(input())
print(num + 2 - (num % 2))
